import {Sphere} from "../interface/sphere";

export const BOT_CONSTRUCTOR: Sphere = {
  name: "bot-constructor",
  viewName: `bot-конструктор`,
  description: `Бот — это автоматизированный многофункциональный помощник, который может показывать информацию подписчикам и собирать информацию по запросу согласно заранее подготовленным сценариям. Telegram − кроссплатформенная система мгновенного обмена сообщениями (мессенджер) с функциями VoIP, позволяющая обмениваться текстовыми, голосовыми и видеосообщениями, стикерами и фотографиями, файлами многих форматов.`,
  content: `<h2>BOT&ndash;КОНСТРУКТОР</h2>
<ol>
<li>ОБЩИЕ ПОЛОЖЕНИЯ</li>
</ol>
<p>Бот &mdash; это автоматизированный многофункциональный помощник, который может показывать информацию подписчикам и собирать информацию по запросу согласно заранее подготовленным сценариям.</p>
<p>Telegram &minus; кроссплатформенная система мгновенного обмена сообщениями (мессенджер) с функциями VoIP, позволяющая обмениваться текстовыми, голосовыми и видеосообщениями, стикерами и фотографиями, файлами многих форматов.</p>
<ol start="2">
<li>О СОРЕВНОВАНИИ</li>
</ol>
<ul>
<li>Соревнования состоит из одного задания.</li>
<li>Чат-бот должен быть написан на любом языке программрования. Использование кострукторов запрещено.</li>
<li>Файловая структура может разделятся на несколько файлов или весь код будет в одном файле.</li>
<li>Для написания бота должден быть аккаунт в мессенджере Telegram.</li>
</ul>
</li>
<ul>
<li>Регистрация бота:</li>
<li>Введите в поле поиска @BotFather и выберите бот.</li>
<li>Нажмите &laquo;Запустить&raquo; для активации бота BotFather.</li>
<li>В ответ вы получите список команд по управлению ботом.</li>
<li>Выберите или напечатайте и отправьте команду /newbot.</li>
<li>Дайте имя боту &mdash; клиенты увидят это имя при общении с ботом. И никнейм бота &mdash; по нему можно будет найти бота в Telegram. Никнейм должен быть уникальным, не повторять существующие в базе и заканчиваться на слово &laquo;bot&raquo;.</li>
<li>После того как вы выберите подходящее имя бот будет создан. Вы получите сообщение со ссылкой на бота t.me/&lt;никнейм_бота&gt;, рекомендации по настройке аватарки, описание бота и список команд для его настройки.
<ul>
<li>Получение токена:</li>
</ul>
</li>
<li>Перейдите к боту @BotFather и введите команду /token.</li>
<li>Вы увидите кнопки с созданными ботами.</li>
<li>Выберите бот, который нужно подключить.</li>
<li>Скопируйте значение токена и втсавьте его переменную в файл проекта.
<ul>
<li>Запуск бота через командную строку: pip install pytelegrambotapi.</li>
</ul>
</li>
</ul>
<ol start="3">
<li>КОНКУРСНОЕ ЗАДАНИЕ</li>
</ol>
<p>Участнику необходимо создать бота в мессенджере Telegram на заданную тематику.</p>
<table >
<tbody>
<tr>
<td >
<p>Максимальное количество баллов</p>
</td>
<td >
<p>100</p>
</td>
</tr>
<tr>
<td >
<p>Из них:</p>
</td>
<td >&nbsp;</td>
</tr>
<tr>
<td >
<p>регистрация бота</p>
</td>
<td >
<p>10</p>
</td>
</tr>
<tr>
<td >
<p>единый стиль написания кода</p>
</td>
<td >
<p>25</p>
</td>
</tr>
<tr>
<td >
<p>соответствие требованиям задания</p>
</td>
<td >
<p>15</p>
</td>
</tr>
<tr>
<td >
<p>использование LayoutButtons</p>
</td>
<td >
<p>15</p>
</td>
</tr>
<tr>
<td >
<p>работоспособность бота</p>
</td>
<td >
<p>35</p>
</td>
</tr>
</tbody>
</table>
<ol start="4">
<li>ПОРОЯДОК ПРОВЕДЕНИЯ СОРЕВНОВАНИЙ</li>
</ol>
<p>Во время проведения конкурса участник должен знать и строго соблюдать правила безопасного поведения учащихся на конкурсной площадке</p>
<p>За грубые нарушения правила безопасного поведения учащихся, которые привели к порче оборудования, инструмента, травме или созданию аварийной ситуации, участник отстраняется от дальнейшего участия в конкурсе. Решение об отстранении принимает председатель жюри.</p>
<ol start="5">
<li>ПРАВИЛА ОПРЕДЕЛЕНИЯ ПОБЕДИТЕЛЯ</li>
</ol>
<p>Участник, набравший наибольшее количество баллов за выполнение одного конкурсного задания, считается победителем.</p>
<p>В случае набора участниками одинакового количества баллов, победителем конкурса считается участник, набравший наибольшее количество баллов и выполнивший конкурсные задания за наименьшее время.</p>
<p>В случае разногласий окончательное решение оценки конкурса принимает главный судья.</p>`
}
