import {Sphere} from "../interface/sphere";

export const DESIGN_ELDER: Sphere = {
  name: "design-elder",
  viewName: `Графический дизайн 10 класс`,
  description: `Графический дизайнер специализируется на оформлении окружающей среды средствами графики. Он работает с вывесками, рекламными щитами, плакатами, указателями, знаками и схемами, а также заботится об удобочитаемости необходимой информации, такой как интернет-сайты, журналы, газеты, листовки, обложки книг и дисков, меню в ресторане, каталоги товаров и др. К направлениям графического дизайна относятся: фирменный стиль и брендинг, разработка шрифтов, дизайн рекламы, дизайн книг, журналов и газет, дизайн для Интернета.`,
  content: `
<ol>
<li>ОБЩИЕ ПОЛОЖЕНИЯ</li>
</ol>
<p>Графический дизайнер специализируется на оформлении окружающей среды средствами графики. Он работает с вывесками, рекламными щитами, плакатами, указателями, знаками и схемами, а также заботится об удобочитаемости необходимой информации, такой как интернет-сайты, журналы, газеты, листовки, обложки книг и дисков, меню в ресторане, каталоги товаров и др. К направлениям графического дизайна относятся: фирменный стиль и брендинг, разработка шрифтов, дизайн рекламы, дизайн книг, журналов и газет, дизайн для Интернета.</p>
<ol start="2">
<li>О СОРЕВНОВАНИИ</li>
</ol>
<p>Конкурсное задание включает в себя выполнение двух заданий, связанных общей темой. Тема заданий определяется членами жюри.</p>
<ol start="3">
<li>ТРЕБОВАНИЯ К УЧАСТНИКУ</li>
</ol>
<p>Участник привозит самостоятельно:</p>
<ul>
<li>компьютер (ноутбук) с программным обеспечением, необходимым для выполнения конкурсного задания: Adobe Acrobat, Adobe Photoshop, Corel DRAW, Adobe Illustrator CC &ndash; 1 шт. и др.;</li>
<li>USB-флеш-накопитель (емкостью не менее 4ГБ) &ndash; 1 шт.;</li>
<li>сетевой фильтр (удлинитель),5 м &ndash; 1 шт.;</li>
</ul>
<ol start="4">
<li>УЧАСТНИКАМ КОНКУРСА ПРЕДЛАГАЕТСЯ:</li>
</ol>
<p>До начала выполнения конкурсных заданий участнику необходимо создать папку на рабочем столе ноутбука (компьютера) и по мере выполнения заданий сохранять все файлы в данной папке. Название <br /> папки &ndash; &laquo;Имя и фамилия учащегося&raquo;.</p>
<h4>4.1 Задание 1</h4>
<ul>
<li>Создать макет логотипа в программе растровой и векторной графики в цветовой модели CMYK (желательно с наличием модульной сетки), имя файла logo;</li>
<li>Подготовить итоговый макет логотипа, содержащий цветной и монохромный варианты логотипа на формате А4;</li>
<li>Текстовые элементы логотипа перевести в кривые;</li>
<li>Перевести макет логотипа в формат PDF, не изменяя имени файла;</li>
<li>Сохранить файл лого в формате PNG (JPEG);</li>
<li>Подготовить к выводу на печать итоговый файл макета логотипа (установить припуски под обрез &ndash; 2 мм);</li>
<li>Написать текстовую аннотацию логотипа, имя файла logo_text.</li>
</ul>
<h4>4.2 Задание 2</h4>
<p>В соответствии с заданием разработать дизайн информационного плаката мероприятия:</p>
<ul>
<li>разработать дизайн оформления плаката, используя созданный логотип;</li>
<li>выбрать итоговую идею и выполнить макет оформления в программе растровой или векторной графики, имя файла PLAKAT (оригиналы сохраняются);</li>
<li>перевести макет оформления в формат PDF, не меняя названия;</li>
<li>сохранить файл в формате PNG (допускается JPEG);</li>
<li>подготовить к выводу на печать итоговые файлы.</li>
</ul>
<p>После выполнения задания папка и все файлы копируются на компьютер жюри для окончательной оценки работ.</p>
<ol start="5">
<li>ПОРЯДОК ПРОВЕДЕНИЯ СОРЕВНОВАНИЙ</li>
</ol>
<p>Во время проведения конкурса участник должен знать и строго соблюдать правила безопасного поведения учащихся на конкурсной площадке</p>
<p>За грубые нарушения правила безопасного поведения учащихся, которые привели к порче оборудования, инструмента, травме или созданию аварийной ситуации, участник отстраняется от дальнейшего участия в конкурсе. Решение об отстранении принимает председатель жюри.</p>
<table >
<tbody>
<tr>
<td >
<p>Показатели и критерии оценок конкурса</p>
<p>&laquo;Графический дизайн&raquo;</p>
<p>Максимальное количество баллов</p>
</td>
<td >
<p>100</p>
</td>
</tr>
<tr>
<td >
<p>Из них:</p>
<p>задание 1 &laquo;Фирменный стиль и продукты брендбука&raquo;</p>
</td>
<td >
<p>40</p>
</td>
</tr>
<tr>
<td >
<p>задание 2 &laquo;Информационный дизайн&raquo;</p>
</td>
<td >
<p>60</p>
</td>
</tr>
</tbody>
</table>
<p>Критерии оценки задания 1 &laquo;Фирменный стиль и продукты брендбука&raquo;</p>
<table >
<tbody>
<tr>
<td >&nbsp;</td>
<td >
<p>Критерии</p>
</td>
<td >
<p>Максимальное количество баллов</p>
</td>
</tr>
<tr>
<td >
<p>1</p>
</td>
<td >
<p>Уникальность, современность логотипа</p>
<p>Оригинальность (идеи, отличающиеся от очевидных, общеизвестных, общепринятых, банальных или твердоустановленных)</p>
</td>
<td >
<p>5</p>
</td>
</tr>
<tr>
<td >
<p>2</p>
</td>
<td >
<p>Беглость &ndash; количество и разнообразие (гибкость) идей. Оцениваются эскизы логотипа</p>
<p>Разработанность &ndash; способность детально разрабатывать возникшие идеи</p>
</td>
<td >
<p>2</p>
</td>
</tr>
<tr>
<td >
<p>3</p>
</td>
<td >
<p>Соответствие цели задания. Логотип.</p>
<p>Универсальность логотипа (возможность размещения эмблемы на сайте, на форменной одежде и т.д.)</p>
</td>
<td >
<p>2</p>
</td>
</tr>
<tr>
<td >
<p>4</p>
</td>
<td >
<p>Простота восприятия логотипа</p>
<p>Легкость запоминания логотипа</p>
</td>
<td >
<p>3</p>
</td>
</tr>
<tr>
<td >
<p>5</p>
</td>
<td >
<p>Гармоничность цветового решения логотипа</p>
</td>
<td >
<p>5</p>
</td>
</tr>
<tr>
<td >
<p>6</p>
</td>
<td >
<p>Оригинальность графического решения</p>
</td>
<td >
<p>5</p>
</td>
</tr>
<tr>
<td >
<p>7</p>
</td>
<td >
<p>Уравновешенность композиции логотипа</p>
</td>
<td >
<p>4</p>
</td>
</tr>
<tr>
<td >
<p>8</p>
</td>
<td >
<p>Владение программными средствами (программы для работы с растровой или векторной графикой)</p>
</td>
<td >
<p>3</p>
</td>
</tr>
<tr>
<td >
<p>9</p>
</td>
<td >
<p>Текстовые элементы переведены в кривые</p>
</td>
<td >
<p>1</p>
</td>
</tr>
<tr>
<td >
<p>10</p>
</td>
<td >
<p>Цветовая модель CMYK</p>
</td>
<td >
<p>1</p>
</td>
</tr>
<tr>
<td >
<p>11</p>
</td>
<td >
<p>Наличие модульной сетки для логотипа</p>
</td>
<td >
<p>1</p>
</td>
</tr>
<tr>
<td >
<p>12</p>
</td>
<td >
<p>Наличие эскизов в папке</p>
</td>
<td >
<p>1</p>
</td>
</tr>
<tr>
<td >
<p>13</p>
</td>
<td >
<p>Наличие текстового описания (в файле или в папке)</p>
</td>
<td >
<p>2</p>
</td>
</tr>
<tr>
<td >
<p>14</p>
</td>
<td >
<p>Наличие итогового файла в растровом векторном формате</p>
</td>
<td >
<p>1</p>
</td>
</tr>
<tr>
<td >
<p>15</p>
</td>
<td >
<p>Наличие итогового файла в PDF и PNG (JPEG) форматах</p>
</td>
<td >
<p>1</p>
</td>
</tr>
<tr>
<td >
<p>16</p>
</td>
<td >
<p>Соответствие финальной электронной версии проекта поставленным требованиям (формат файла, технические характеристики носителя)</p>
</td>
<td >
<p>3</p>
</td>
</tr>
<tr>
<td >&nbsp;</td>
<td >
<p>Максимальная сумма баллов:</p>
</td>
<td >
<p>40</p>
</td>
</tr>
</tbody>
</table>
<p>Критерии оценки задания 2 &laquo;Информационный дизайн&raquo;</p>
<table >
<tbody>
<tr>
<td >&nbsp;</td>
<td >
<p>Критерии</p>
</td>
<td >
<p>Максимальное количество баллов</p>
</td>
</tr>
<tr>
<td >
<p>1</p>
</td>
<td >
<p>Уникальность, современность афиши (информационный плакат)</p>
<p>Оригинальность (идеи, отличающиеся от очевидных, общеизвестных, общепринятых, банальных или твердоустановленных)</p>
</td>
<td >
<p>10</p>
</td>
</tr>
<tr>
<td >
<p>2</p>
</td>
<td >
<p>Разработанность &ndash; способность детально разрабатывать возникшие идеи</p>
</td>
<td >
<p>10</p>
</td>
</tr>
<tr>
<td >
<p>3</p>
</td>
<td >
<p>Гармоничность цветового решения афиши</p>
<p>Оригинальность графического решения</p>
<p>Выразительность композиционного решения оформления</p>
</td>
<td >
<p>10</p>
</td>
</tr>
<tr>
<td >
<p>4</p>
</td>
<td >
<p>Креативность текстовой информации (слоган, рекламный текст)</p>
</td>
<td >
<p>5</p>
</td>
</tr>
<tr>
<td >
<p>5</p>
</td>
<td >
<p>Гармоничность применения шрифтов</p>
</td>
<td >
<p>5</p>
</td>
</tr>
<tr>
<td >
<p>6</p>
</td>
<td >
<p>Качество прорисовки проекта</p>
<p>Технический уровень выполнения всех компонентов комплексного проекта</p>
</td>
<td >
<p>5</p>
</td>
</tr>
<tr>
<td >
<p>7</p>
</td>
<td >
<p>Владение программными средствами (программы для работы с растровой и векторной графикой)</p>
</td>
<td >
<p>5</p>
</td>
</tr>
<tr>
<td >
<p>8</p>
</td>
<td >
<p>Текстовые элементы переведены в кривые</p>
<p>Цветовая модель CMYK</p>
</td>
<td >
<p>1</p>
</td>
</tr>
<tr>
<td >
<p>9</p>
</td>
<td >
<p>Наличие текстового описания (в файле или в папке)</p>
</td>
<td >
<p>2</p>
</td>
</tr>
<tr>
<td >
<p>10</p>
</td>
<td >
<p>Наличие итогового файла в растровом и векторном форматах</p>
<p>Наличие итогового файла в PDF и PNG (JPEG) форматах</p>
</td>
<td >
<p>1</p>
</td>
</tr>
<tr>
<td >
<p>11</p>
</td>
<td >
<p>Соответствие финальной электронной версии проекта поставленным требованиям (формат файла, технические характеристики носителя)</p>
</td>
<td >
<p>3</p>
</td>
</tr>
<tr>
<td >
<p>12</p>
</td>
<td >
<p>Минимальное время выполнения задания</p>
</td>
<td >
<p>3</p>
</td>
</tr>
<tr>
<td >&nbsp;</td>
<td >
<p>Максимальная сумма баллов:</p>
</td>
<td >
<p>60</p>
</td>
</tr>
</tbody>
</table>
<ol start="6">
<li>ПРАВИЛА ОПРЕДЕЛЕНИЯ ПОБЕДИТЕЛЯ</li>
</ol>
<p>Участник, набравший наибольшее количество баллов за выполнение двух конкурсных заданий, считается победителем.</p>
<p>В случае набора участниками одинакового количества баллов, победителем конкурса считается участник, набравший наибольшее количество баллов и выполнивший конкурсные задания за наименьшее время.</p>
<p>В случае разногласий окончательное решение оценки конкурса принимает главный судья.</p>`
}
