import { Sphere } from '../interface/sphere'
import beDictionary from '../../../assets/i18n/be.json'
import ruDictionary from '../../../assets/i18n/ru.json'
import enDictionary from '../../../assets/i18n/en.json'

export class WEB_DESIGN {
  private static nameSphere: string = 'web-design'

  private static viewNameRU: string = ruDictionary.SPHERE['web-design'].viewName
  private static viewNameBE: string = beDictionary.SPHERE['web-design'].viewName
  private static viewNameEN: string = enDictionary.SPHERE['web-design'].viewName

  private static descriptionRU: string =
    ruDictionary.SPHERE['web-design'].description
  private static descriptionBE: string =
    beDictionary.SPHERE['web-design'].description
  private static descriptionEN: string =
    enDictionary.SPHERE['web-design'].description

  private static contentRU: string = `
        <ol>
            <li>ОБЩИЕ ПОЛОЖЕНИЯ</li>
        </ol>
        <p>Веб-дизайн&nbsp;&mdash; вид&nbsp;<a
                href="https://ru.wikipedia.org/wiki/%D0%93%D1%80%D0%B0%D1%84%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9_%D0%B4%D0%B8%D0%B7%D0%B0%D0%B9%D0%BD">графического
                дизайна</a>, направленный на разработку и оформление объектов информационной среды&nbsp;<a
                href="https://ru.wikipedia.org/wiki/%D0%98%D0%BD%D1%82%D0%B5%D1%80%D0%BD%D0%B5%D1%82">Интернета</a>, призванный
            обеспечить им высокие потребительские свойства и&nbsp;<a
                href="https://ru.wikipedia.org/wiki/%D0%AD%D1%81%D1%82%D0%B5%D1%82%D0%B8%D0%BA%D0%B0">эстетические</a>&nbsp;качества.
            Подобная трактовка отделяет веб-дизайн от&nbsp;<a
                href="https://ru.wikipedia.org/wiki/%D0%92%D0%B5%D0%B1-%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">веб-программирования</a>,
            подчёркивает специфику предметной деятельности веб-дизайнера, позиционирует веб-дизайн как вид графического дизайна.
            Немаловажной частью проектирования ресурса в последнее время стало приведение ресурса в соответствие
            стандартам&nbsp;<a href="https://ru.wikipedia.org/wiki/W3C">W3C</a>, что обеспечивает доступность содержания
            для&nbsp;<a href="https://ru.wikipedia.org/wiki/%D0%98%D0%BD%D0%B2%D0%B0%D0%BB%D0%B8%D0%B4">инвалидов</a>&nbsp;и
            пользователей портативных устройств.</p>
        <ol start="2">
            <li>О СОРЕВНОВАНИИ</li>
        </ol>
        <p>Конкурсное задание включает в себя выполнение одного задания. Тема задания определяется членами жюри.</p>
        <ol start="3">
            <li>ТРЕБОВАНИЯ К УЧАСТНИКУ</li>
        </ol>
        <p>Участник привозит самостоятельно:</p>
        <ul>
            <li>компьютер (ноутбук) с программным обеспечением, необходимым для выполнения конкурсного задания: Adobe Photoshop или Figma (на выбор участника) – 1 шт.</li>
            <li>USB-флеш-накопитель (емкостью не менее 4 ГБ) &ndash; 1 шт.</li>
            <li>сетевой фильтр (удлинитель) 5 м – 1 шт.</li>
        </ul>
        <ol start="4">
            <li>УЧАСТНИКАМ КОНКУРСА ПРЕДЛАГАЕТСЯ:</li>
        </ol>
        <p>До начала выполнения конкурсных заданий участнику необходимо создать папку на рабочем столе ноутбука (компьютера) и по мере выполнения заданий сохранять все файлы в данной папке. Название папки – «Первые буквы ФИО + код региона», в папке содержатся «Задание», в которой содержатся «Рабочая» и «Итоговая» папки.</p>
        <ol start="5">
            <li>КОНКУРСНОЕ ЗАДАНИЕ</li>
        </ol>
        <p>Создать макет страницы сайта по схеме.</p>
        <p>Макет необходимо отрисовать в 3-х разрешениях desktop &ndash; 1920px, tablet &ndash; 800px, mobile &ndash; 360px.
            Текст в схеме можно изменять и дополнять, не меняя основной смысл.</p>
        <p>Допускается использование не более 3-х готовых изображений (фото). Все иконки должны быть отрисованы самостоятельно,
            кроме лого соц.сетей. Кнопки и ссылки обязательно отрисовываются в отдельной монтажной области в 3-х состояниях
            (styleguide): normal, hover, down.</p>
        <p>Входные данные: Лого.png, Схема.docx, Логотипы соц.сетей в png</p>
        <p>Выходные данные: Файл в формате fig (все макеты размещаются в одном файле в разных монтажных областях)</p>
        <p>или набор файлов psd (каждый макет в отдельном файле)</p>
        <p>в зависимости от используемого графического редактора.</p>
        <p>После выполнения задания папка и все файлы копируются на компьютер главного судьи для окончательной оценки работ.</p>
        <ol start="6">
            <li>КРИТЕРИИ ОЦЕНКИ</li>
        </ol>
        <table>
            <tbody>
                <tr>
                    <td>
                        <p>№ п/п</p>
                    </td>
                    <td>
                        <p>Критерии</p>
                    </td>
                    <td>
                        <p>Максимальное количество баллов</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>1.</p>
                    </td>
                    <td>
                        <p>Оригинальность идеи</p>
                    </td>
                    <td>
                        <p>10</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>2.</p>
                    </td>
                    <td>
                        <p>Разработанность &ndash; способность детально разрабатывать возникшие идеи</p>
                    </td>
                    <td>
                        <p>10</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>3.</p>
                    </td>
                    <td>
                        <p>Гармоничность цветового решения</p>
                    </td>
                    <td>
                        <p>5</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>4.</p>
                    </td>
                    <td>
                        <p>Оригинальность графического решения</p>
                    </td>
                    <td>
                        <p>5</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>5.</p>
                    </td>
                    <td>
                        <p>Уравновешенность композиции</p>
                    </td>
                    <td>
                        <p>10</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>6.</p>
                    </td>
                    <td>
                        <p>Наличие 3 вариантов разрешений (каждое 5 баллов)</p>
                    </td>
                    <td>
                        <p>15</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>7.</p>
                    </td>
                    <td>
                        <p>Вставка готовых изображений</p>
                    </td>
                    <td>
                        <p>5</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>8.</p>
                    </td>
                    <td>
                        <p>Вставка самостоятельно нарисованных изображений</p>
                    </td>
                    <td>
                        <p>10</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>9.</p>
                    </td>
                    <td>
                        <p>Отдельный блок styleguide</p>
                    </td>
                    <td>
                        <p>10</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>10.</p>
                    </td>
                    <td>
                        <p>Наличие всех необходимых файлов (монтажных областей)</p>
                    </td>
                    <td>
                        <p>10</p>
                    </td>
                </tr>
                <tr>
                    <td>
                        <p>11.</p>
                    </td>
                    <td>
                        <p>Работа со слоями</p>
                    </td>
                    <td>
                        <p>10</p>
                    </td>
                </tr>
                <tr>
                    <td>&nbsp;</td>
                    <td>
                        <p>Максимальная сумма баллов:</p>
                    </td>
                    <td>
                        <p>100</p>
                    </td>
                </tr>
            </tbody>
        </table>
        <ol start="7">
            <li>ПОРЯДОК ПРОВЕДЕНИЯ СОРЕВНОВАНИЙ</li>
        </ol>
        <p>Во время проведения конкурса участник должен знать и строго соблюдать правила безопасного поведения учащихся на
            конкурсной площадке</p>
        <p>За грубые нарушения правила безопасного поведения учащихся, которые привели к порче оборудования, инструмента, травме или созданию аварийной ситуации, участник отстраняется от дальнейшего участия в конкурсе. Решение об отстранении принимает главный судья.</p>
        <ol start="8">
            <li>ПРАВИЛА ОПРЕДЕЛЕНИЯ ПОБЕДИТЕЛЯ</li>
        </ol>
        <p>Участник, набравший наибольшее количество баллов за выполнение конкурсного задания, считается победителем.</p>
        <p>В случае набора участниками одинакового количества баллов, победителем конкурса считается участник, набравший
            наибольшее количество баллов и выполнивший конкурсное задания за наименьшее время.</p>
        <p>В случае разногласий окончательное решение оценки конкурса принимает главный судья.</p>
    `
  private static contentBE: string = `<ol>
<li>АГУЛЬНЫЯ ПАЛАЖЭННІ</li>
</ol>
<p>Вэб-дызайн &mdash; вид&nbsp;<a href="https://ru.wikipedia.org/wiki/%D0%93%D1%80%D0%B0%D1%84%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9_%D0%B4%D0%B8%D0%B7%D0%B0%D0%B9%D0%BD">графічнага дызайну</a>,&nbsp;накіраваны на распрацоўку і афармленне аб'ектаў інфармацыйнага асяроддзя <a href="https://ru.wikipedia.org/wiki/%D0%98%D0%BD%D1%82%D0%B5%D1%80%D0%BD%D0%B5%D1%82">Інтэрнэту</a>,&nbsp;закліканы забяспечыць ім высокія спажывецкія ўласцівасці і <a href="https://ru.wikipedia.org/wiki/%D0%AD%D1%81%D1%82%D0%B5%D1%82%D0%B8%D0%BA%D0%B0">эстэтычныя</a> якасці.&nbsp;Падобная трактоўка аддзяляе вэб-дызайн ад <a href="https://ru.wikipedia.org/wiki/%D0%92%D0%B5%D0%B1-%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">вэб-праграміравання</a>,&nbsp;падкрэслівае спецыфіку прадметнай дзейнасці вэб-дызайнера, пазіцыяніруе вэб-дызайн як від графічнага дызайну. Немалаважнай часткай праектавання рэсурсу ў апошні час стала прывядзенне рэсурсу ў адпаведнасць стандартам <a href="https://ru.wikipedia.org/wiki/W3C">W3C</a>, што забяспечвае даступнасць зместу для інвалідаў і карыстальнікаў партатыўных прылад.</p>
<ol start="2">
<li>АБ СПАБОРНІЦТВЕ</li>
</ol>
<p>Конкурснае заданне ўключае ў сябе выкананне аднаго задання. Тэма задання вызначаецца членамі журы.</p>
<ol start="3">
<li>ПАТРАБАВАННІ ДА ЎДЗЕЛЬНІКАЎ</li>
</ol>
<p>Удзельнік прывозіць самастойна:</p>
<ul>
<li>камп'ютар (ноўтбук) з праграмным забеспячэннем, неабходным для выканання конкурснага задання: Adobe Photoshop або Figma (на выбар удзельніка) - 1 шт.</li>
<li>USB-флэш-назапашвальнік (ёмістасцю не менш за 4 ГБ) - 1 шт;</li>
<li>сеткавы фільтр (падаўжальнікам) 5 м - 1 шт.</li>
</ul>
<ol start="4">
<li>УДЗЕЛЬНІКАМ КОНКУРСУ ПРАПАНОЎВАЕЦЦА:</li>
</ol>
<p>Да пачатку выканання конкурсных заданняў удзельніку неабходна стварыць тэчку на працоўным стале ноўтбука (камп'ютара) і па меры выканання заданняў захоўваць усе файлы ў дадзенай тэчцы. Назва тэчкі - "Першыя літары. Прозвішча, імя, код рэгіёну", у тэчцы змяшчаюцца "Заданне", у якой змяшчаюцца "Рабочая" і "Выніковая" тэчкі.</p>
<ol start="5">
<li>КОНКУРСНАЕ ЗАДАННЕ</li>
</ol>
<p>Стварыць макет старонкі сайта па схеме.</p>
<p>Макет неабходна адмаляваць у 3-х дазволах desktop - 1920px, tablet - 800px, mobile - 360px. Тэкст у схеме можна змяняць і дапаўняць, не мяняючы асноўны сэнс.</p>
<p>Дапускаецца выкарыстанне не больш за 3 гатовыя выявы (фота). Усе абразкі павінны быць адмаляваныя самастойна, акрамя лага соц. сетак. Кнопкі і спасылкі абавязкова адмалёўваюцца ў асобнай мантажнай вобласці ў 3-х станах (styleguide): normal, hover, down.</p>
<p>Уваходныя дадзеныя: Лога.png, Схема.docx, Лагатыпы соц.сетак у png</p>
<p>Выходныя дадзеныя: Файл у фармаце fig (усе макеты размяшчаюцца ў адным файле ў розных мантажных абласцях) ці набор файлаў psd (кожны макет у асобным файле) у залежнасці ад выкарыстанага графічнага рэдактара.</p>
<p>Пасля выканання задання тэчка і ўсе файлы капіруюцца на камп'ютар галоўнага суддзі для канчатковай адзнакі прац.</p>
<ol start="6">
<li>КРЫТЭРЫІ &nbsp;АДЗНАКІ</li>
</ol>
<table>
<tbody>
<tr>
<td>
<p>№ п/п</p>
</td>
<td>
<p>Крытэрыі</p>
</td>
<td>
<p>Максімальная колькасць балаў</p>
</td>
</tr>
<tr>
<td>
<p>1.</p>
</td>
<td>
<p>Арыгінальнасць ідэі</p>
</td>
<td>
<p>10</p>
</td>
</tr>
<tr>
<td>
<p>2.</p>
</td>
<td>
<p>Распрацаванасць - здольнасць дэталёва распрацоўваць ідэі, якія ўзніклі</p>
</td>
<td>
<p>10</p>
</td>
</tr>
<tr>
<td>
<p>3.</p>
</td>
<td>
<p>Гарманічнасць каляровага рашэння</p>
</td>
<td>
<p>5</p>
</td>
</tr>
<tr>
<td>
<p>4.</p>
</td>
<td>
<p>Арыгінальнасць графічнага рашэння</p>
</td>
<td>
<p>5</p>
</td>
</tr>
<tr>
<td>
<p>5.</p>
</td>
<td>
<p>Ураўнаважанасць кампазіцыі</p>
</td>
<td>
<p>10</p>
</td>
</tr>
<tr>
<td>
<p>6.</p>
</td>
<td>
<p>Наяўнасць 3 варыянтаў дазволаў (кожнае 5 балаў)</p>
</td>
<td>
<p>15</p>
</td>
</tr>
<tr>
<td>
<p>7.</p>
</td>
<td>
<p>Устаўка гатовых малюнкаў</p>
</td>
<td>
<p>5</p>
</td>
</tr>
<tr>
<td>
<p>8.</p>
</td>
<td>
<p>Устаўка самастойна намаляваных малюнкаў</p>
</td>
<td>
<p>10</p>
</td>
</tr>
<tr>
<td>
<p>9.</p>
</td>
<td>
<p>Асобны блок styleguide</p>
</td>
<td>
<p>10</p>
</td>
</tr>
<tr>
<td>
<p>10.</p>
</td>
<td>
<p>Наяўнасць усіх неабходных файлаў (мантажных абласцей)</p>
</td>
<td>
<p>10</p>
</td>
</tr>
<tr>
<td>
<p>11.</p>
</td>
<td>
<p>Праца са пластамі</p>
</td>
<td>
<p>10</p>
</td>
</tr>
<tr>
<td>&nbsp;</td>
<td>
<p>Максімальная сума балаў:</p>
</td>
<td>
<p>100</p>
</td>
</tr>
</tbody>
</table>
<ol start="7">
<li>ПАРАДАК ПРАВЯДЗЕННЯ СПАБОРНІЦТВАЎ</li>
</ol>
<p>У час правядзення конкурсу ўдзельнік павінен ведаць і строга выконваць правілы бяспечных паводзін вучняў на конкурснай пляцоўцы.</p>
<p>За грубыя парушэнні правіл бяспечных паводзін навучэнцаў, якія прывялі да псавання абсталявання, інструмента, траўмы або стварэння аварыйнай сітуацыі, удзельнік адхіляецца ад далейшага ўдзелу ў конкурсе. Рашэнне аб адхіленні прымае галоўны суддзя.</p>
<ol start="8">
<li>ПРАВІЛЫ ВЫЗНАЧЭННЯ ПЕРАМОЖЦЫ</li>
</ol>
<p>Удзельнік, які набраў найбольшую колькасць балаў за выкананне конкурснага задання, лічыцца пераможцам.</p>
<p>У выпадку набору ўдзельнікамі аднолькавай колькасці балаў, пераможцам конкурсу лічыцца ўдзельнік, які набраў найбольшую колькасць балаў і выканаў конкурснае заданне за найменшы час.</p>
<p>У выпадку рознагалоссяў канчатковае рашэнне адзнакі конкурсу прымае галоўны суддзя.</p>`
  private static contentEN: string =
    'Information is temporarily unavailable. You can view details in Russian or Belarusian languages'

  static getItem(currentLang: string): Sphere {
    let competence

    if (currentLang == 'ru') {
      competence = this.ruTranslate
    } else if (currentLang == 'be') {
      competence = this.beTranslate
    } else {
      competence = this.enTranslate
    }

    return competence
  }

  private static ruTranslate: Sphere = {
    name: this.nameSphere,
    viewName: this.viewNameRU,
    description: this.descriptionRU,
    content: this.contentRU,
    viewNameRU: this.viewNameRU
  }

  private static beTranslate: Sphere = {
    name: this.nameSphere,
    viewName: this.viewNameBE,
    description: this.descriptionBE,
    content: this.contentBE,
    viewNameRU: this.viewNameRU
  }

  private static enTranslate: Sphere = {
    name: this.nameSphere,
    viewName: this.viewNameEN,
    description: this.descriptionEN,
    content: this.contentEN,
    viewNameRU: this.viewNameRU
  }
}
