import {Sphere} from "../interface/sphere";

export const WEB_DESIGN: Sphere = {
  name: "web-design",
  viewName: "Web-дизайн",
  description: `Веб-дизайн — вид графического дизайна, направленный на разработку и оформление объектов информационной среды Интернета, призванный обеспечить им высокие потребительские свойства и эстетические качества. Подобная трактовка отделяет веб-дизайн от веб-программирования, подчёркивает специфику предметной деятельности веб-дизайнера, позиционирует веб-дизайн как вид графического дизайна. Немаловажной частью проектирования ресурса в последнее время стало приведение ресурса в соответствие стандартам W3C, что обеспечивает доступность содержания для инвалидов и пользователей портативных устройств.`,
  content: `<h2>WEB&ndash;ДИЗАЙН</h2>
<ol>
<li>ОБЩИЕ ПОЛОЖЕНИЯ</li>
</ol>
<p>Веб-дизайн&nbsp;&mdash; вид&nbsp;<a href="https://ru.wikipedia.org/wiki/%D0%93%D1%80%D0%B0%D1%84%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9_%D0%B4%D0%B8%D0%B7%D0%B0%D0%B9%D0%BD">графического дизайна</a>, направленный на разработку и оформление объектов информационной среды&nbsp;<a href="https://ru.wikipedia.org/wiki/%D0%98%D0%BD%D1%82%D0%B5%D1%80%D0%BD%D0%B5%D1%82">Интернета</a>, призванный обеспечить им высокие потребительские свойства и&nbsp;<a href="https://ru.wikipedia.org/wiki/%D0%AD%D1%81%D1%82%D0%B5%D1%82%D0%B8%D0%BA%D0%B0">эстетические</a>&nbsp;качества. Подобная трактовка отделяет веб-дизайн от&nbsp;<a href="https://ru.wikipedia.org/wiki/%D0%92%D0%B5%D0%B1-%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">веб-программирования</a>, подчёркивает специфику предметной деятельности веб-дизайнера, позиционирует веб-дизайн как вид графического дизайна. Немаловажной частью проектирования ресурса в последнее время стало приведение ресурса в соответствие стандартам&nbsp;<a href="https://ru.wikipedia.org/wiki/W3C">W3C</a>, что обеспечивает доступность содержания для&nbsp;<a href="https://ru.wikipedia.org/wiki/%D0%98%D0%BD%D0%B2%D0%B0%D0%BB%D0%B8%D0%B4">инвалидов</a>&nbsp;и пользователей портативных устройств.</p>
<ol start="2">
<li>О СОРЕВНОВАНИИ</li>
</ol>
<p>Конкурсное задание включает в себя выполнение одного задания. Тема задания определяется членами жюри.</p>
<ol start="2">
<li>ТРЕБОВАНИЯ К УЧАСТНИКУ</li>
</ol>
<p>Участник привозит самостоятельно:</p>
<ul>
<li>компьютер (ноутбук) с программным обеспечением, необходимым для выполнения конкурсного задания: Adobe Photoshop или Figma (на выбор участника) &ndash; 1 шт;</li>
<li>USB-флеш-накопитель &ndash; 1 шт;</li>
<li>сетевой фильтр (удлинитель), 5 м &ndash; 1 шт.</li>
</ul>
<ol start="3">
<li>УЧАСТНИКАМ КОНКУРСА ПРЕДЛАГАЕТСЯ:</li>
</ol>
<p>До начала выполнения конкурсных заданий участнику необходимо создать папку на рабочем столе ноутбука (компьютера) и по мере выполнения заданий сохранять все файлы в данной папке. Название <br /> папки &ndash; &laquo;Имя и фамилия учащегося&raquo;.</p>
<p>4.1 КОНКУРСНОЕ ЗАДАНИЕ</p>
<p>Создать макет страницы сайта по схеме.</p>
<p>Макет необходимо отрисовать в 3-х разрешениях desktop &ndash; 1920px, tablet &ndash; 800px, mobile &ndash; 360px. Текст в схеме можно изменять и дополнять, не меняя основной смысл.</p>
<p>Допускается использование не более 3-х готовых изображений (фото). Все иконки должны быть отрисованы самостоятельно, кроме лого соц.сетей. Кнопки и ссылки обязательно отрисовываются в отдельной монтажной области в 3-х состояниях (styleguide): normal, hover, down.</p>
<p>Входные данные: Лого.png, Схема.docx, Логотипы соц.сетей в png</p>
<p>Выходные данные: Файл в формате fig (все макеты размещаются в одном файле в разных монтажных областях)</p>
<p>или набор файлов psd (каждый макет в отдельном файле)</p>
<p>в зависимости от используемого графического редактора.</p>
<p>После выполнения задания папка и все файлы копируются на компьютер жюри для окончательной оценки работ.</p>
<ol start="4">
<li>КРИТЕРИИ ОЦЕНКИ</li>
</ol>
<table >
<tbody>
<tr>
<td >
<p>№ п/п</p>
</td>
<td >
<p>Критерии</p>
</td>
<td >
<p>Максимальное количество баллов</p>
</td>
</tr>
<tr>
<td >
<p>1.</p>
</td>
<td >
<p>Оригинальность идеи</p>
</td>
<td >
<p>10</p>
</td>
</tr>
<tr>
<td >
<p>2.</p>
</td>
<td >
<p>Разработанность &ndash; способность детально разрабатывать возникшие идеи</p>
</td>
<td >
<p>10</p>
</td>
</tr>
<tr>
<td >
<p>3.</p>
</td>
<td >
<p>Гармоничность цветового решения</p>
</td>
<td >
<p>10</p>
</td>
</tr>
<tr>
<td >
<p>4.</p>
</td>
<td >
<p>Оригинальность графического решения</p>
</td>
<td >
<p>10</p>
</td>
</tr>
<tr>
<td >
<p>5.</p>
</td>
<td >
<p>Уравновешенность композиции</p>
</td>
<td >
<p>10</p>
</td>
</tr>
<tr>
<td >
<p>6.</p>
</td>
<td >
<p>Наличие 3 вариантов разрешений (каждое 5 баллов)</p>
</td>
<td >
<p>15</p>
</td>
</tr>
<tr>
<td >
<p>7.</p>
</td>
<td >
<p>Вставка готовых изображений</p>
</td>
<td >
<p>5</p>
</td>
</tr>
<tr>
<td >
<p>8.</p>
</td>
<td >
<p>Вставка самостоятельно нарисованных изображений</p>
</td>
<td >
<p>10</p>
</td>
</tr>
<tr>
<td >
<p>9.</p>
</td>
<td >
<p>Отдельный блок styleguide</p>
</td>
<td >
<p>10</p>
</td>
</tr>
<tr>
<td >
<p>10.</p>
</td>
<td >
<p>Наличие всех необходимых файлов (монтажных областей)</p>
</td>
<td >
<p>10</p>
</td>
</tr>
<tr>
<td >&nbsp;</td>
<td >
<p>Максимальная сумма баллов:</p>
</td>
<td >
<p>100</p>
</td>
</tr>
</tbody>
</table>
<ol start="5">
<li>ПОРЯДОК ПРОВЕДЕНИЯ СОРЕВНОВАНИЙ</li>
</ol>
<p>Во время проведения конкурса участник должен знать и строго соблюдать правила безопасного поведения учащихся на конкурсной площадке</p>
<p>За грубые нарушения правила безопасного поведения учащихся, которые привели к порче оборудования, инструмента, травме или созданию аварийной ситуации, участник отстраняется от дальнейшего участия в конкурсе. Решение об отстранении принимает председатель жюри.</p>
<ol start="6">
<li>ПРАВИЛА ОПРЕДЕЛЕНИЯ ПОБЕДИТЕЛЯ</li>
</ol>
<p>Участник, набравший наибольшее количество баллов за выполнение конкурсного задания, считается победителем.</p>
<p>В случае набора участниками одинакового количества баллов, победителем конкурса считается участник, набравший наибольшее количество баллов и выполнивший конкурсное задания за наименьшее время.</p>
<p>В случае разногласий окончательное решение оценки конкурса принимает председатель жюри.</p>`
}
